{
  "founder": {
    "name": "Dr. Effiong Udo Umoren",
    "birthDate": "18th December, 1901",
    "deathDate": "18th December, 2002",
    "title": "Founder and Father of Homeopathy in Nigeria",
    "biography": {
      "earlyLife": {
        "birthPlace": "Ikot Akpan, Ikot-Eyo in Ubium clan, Nsit Ubium Local Government Area of Akwa Ibom State",
        "father": "Effiong Udo Umoren - popular and renowned herbalist, traditional medicine healer and farmer",
        "mother": "Mrs. Edemekong Udo Umoren from Obio Akpa Idu in Ubium clan",
        "education": {
          "primary": "Native authority school at Ikot Okwot (completed standard three)",
          "secondary": "Presbyterian Primary School at Itu (finished standard six)",
          "certifications": [
            "General Certificate of Education, Junior Cambridge (1920)",
            "London matriculation examination (1925)"
          ]
        }
      },
      "internationalEducation": {
        "institution": "International Free Protestant Episcopal University, London",
        "degrees": [
          "Degree in Naturopathy (N.D) - 1930",
          "Degree in Biochemistry - 1933",
          "Doctorate degree in Homeopathic Medicine (DHM) - 1935",
          "Doctor of Science (D.Sc) - 1950",
          "Doctor of Philosophy in Homeopathic Medicine (PhD) - St. Andrew's intercollegiate foundation, London",
          "Degree in Diet and nutrition - 1962",
          "Degree in Psychology - University of the Science of man in Great Britain (1971)",
          "Doctor of Botanic medicine - Brandridge forest school-London (1972)"
        ],
        "fellowships": [
          "Fellow of Indian Academy of Science",
          "Fellow of self-culture university"
        ]
      },
      "practice": {
        "started": "1940",
        "privatePractice": "1950s",
        "specialization": "Pioneer practitioner in Homoeopathy and natural therapeutics"
      },
      "achievements": [
        "First practitioner of homeopathic system of medicine in Nigeria",
        "Founder of first Association of Nigerian Homeopathic and natural therapeutics in 1965 (Registration No. 130384)",
        "First president and Founding father of Nigerian Homeopathic Association",
        "Well known columnist in the monitor Newspaper",
        "Elder statesman in the vanguard for the struggle of emancipation from colonial masters",
        "Effective representative of Ubium county council for about twelve years",
        "Appointment to local school Board, Etinan L.G.A. (1971-1974)"
      ],
      "character": [
        "Reserved in early life, loved quiet life",
        "Extra-ordinary boy with hidden virtue",
        "Inquisitive, curious, witty and meticulous",
        "Researchful and fond of asking questions",
        "Had a flair for reading",
        "Great dreamer of dreams and a doer of deeds",
        "Dedicated to noble ideals, entirely selfless",
        "Truthful in speech, fearless in action",
        "Meek as a lamb, but a lion in spirit"
      ],
      "religiousLife": {
        "church": "Qua Iboe church",
        "roles": ["Very good singer", "Choir master", "Sunday school teacher"],
        "ministry": "Started ministry at age 12, claimed divine call",
        "contribution": "Leased property to Qua Iboe church, Ikot Eyo for worship centre",
        "generosity": "Sent money, church Hymnaries and bibles every year"
      },
      "politicalLife": {
        "party": "Member of NCNC",
        "mentor": "Great Dr. Nnamdi Azikiwe",
        "role": "Elder statesman in emancipation struggle",
        "service": "Representative of Ubium county council (12 years)"
      }
    }
  },
  "collegeHistory": {
    "foundation": {
      "year": "1982",
      "originalName": "Cottage Homoeopathic Medical College and Hospital",
      "location": "60 Aka Road, Uyo",
      "state": "Cross River State (now Akwa Ibom State)",
      "purpose": "Teaching of classical and modern Homoeopathy as well as other alternative medicine"
    },
    "currentLocation": {
      "address": "No.1 Uwa Street, Uyo opposite ministry of Education (Examinations and Certification Division)",
      "city": "Uyo Capital City of Akwa Ibom State",
      "description": "Quiet secluded part of Uyo",
      "contact": {
        "phone1": "08037935596",
        "phone2": "07088418182",
        "visitPolicy": "Previous appointment essential, minimum 48hrs notice required"
      }
    },
    "development": {
      "timeline": [
        {
          "year": "1982",
          "event": "College founded by Dr. E. U. Umoren",
          "name": "Cottage Homoeopathic Medical College and Hospital"
        },
        {
          "year": "2002",
          "event": "Dr. E. U. Umoren passed away peacefully",
          "description": "End of year party with students, took bible to bedroom, peaceful transition next morning"
        },
        {
          "year": "2007",
          "event": "10 man committee set up to edit, review and rewrite college curriculum",
          "description": "More comprehensive, authentic, accurate and elucidated compilation"
        }
      ]
    },
    "curriculumApproval": {
      "approvedBy": [
        "ALL NIGERIA HOMOEOPATHIC MEDICAL ASSOCIATION",
        "LIGA MEDCORM HOMOEOPATHICA INTERNATIONALS",
        "BRITISH HOMOEOPATHIC RESEARCH GROUP",
        "FOUNDATION FOR HOMOEOPATHIC EDUCATION AND RESEARCH"
      ],
      "description": "Invaluable book of reference for lecturers and students"
    }
  },
  "academicPrograms": {
    "title": "Academic Programs",
    "description": "Comprehensive educational programs in Homoeopathic and Alternative Medicine",
    "faculties": [
      {
        "name": "Faculty of Homoeopathic Medical Sciences",
        "description": "The Faculty of Homoeopathic Medical Sciences is dedicated to producing highly skilled practitioners in classical and modern homoeopathy. Our comprehensive curriculum combines theoretical knowledge with practical clinical experience.",
        "departments": [
          {
            "name": "Homoeopathic Clinical Medicine",
            "offering": "DHM [Advanced] equivalent to first degree [B.Sc.]",
            "description": "Advanced training in clinical diagnosis, repertorization, and case management using classical homoeopathic principles"
          },
          {
            "name": "Homoeopathic Nursing/Midwifery",
            "offering": "Ordinary diploma (OD-HNM) and Advanced diploma (AD-HNM)",
            "description": "Specialized training for nurses and midwives in homoeopathic patient care and maternal health"
          },
          {
            "name": "Veterinary Homoeopathy",
            "offering": "D. Vet.HOM.",
            "description": "Application of homoeopathic principles to animal health and veterinary practice"
          },
          {
            "name": "Homoeopathic Pharmacy",
            "offering": "Advanced diploma in homoeopathic pharmacy [DHPh]",
            "description": "Training in preparation, dispensing, and quality control of homoeopathic medicines"
          },
          {
            "name": "Electro-homoeopathy",
            "offering": "Diploma in Electro-homoeopathy [Dip.EH]",
            "description": "Study of plant-based spagyric remedies and electro-homoeopathic treatment methods"
          }
        ]
      },
      {
        "name": "Faculty of Alternative/Complementary Medicine",
        "description": "The Faculty of Alternative/Complementary Medicine offers diverse programs in various natural healing modalities. Students receive comprehensive training in multiple therapeutic approaches to provide holistic patient care.",
        "programs": [
          "Naturopathy",
          "Biochemistry",
          "Diet and Nutrition",
          "Botanic Medicine",
          "Traditional Medicine",
          "Natural Therapeutics"
        ],
        "qualifications": "Offering degrees, post graduate diploma, advanced diploma, diploma and certificate programs"
      }
    ]
  },
  "objectives": [
    "To produce homoeopathic and other alternative medical doctors with technical, analytical, diagnostic, scientific, medical and pharmaceutical knowledge",
    "To produce pharmaceutical scientists, chemists, and druggists in alternative medicine",
    "To award certificate, diploma and degree to highly competent, ethically and professionally sound persons",
    "To assist in the scientific evaluation of medical claims by practitioners of traditional medicine",
    "To produce properly trained alternative medical practitioners at both sub-professional and professional levels",
    "To make students aware that higher education carries obligation to contribute to betterment of man and society",
    "To encourage students to develop system of values against which to judge use of knowledge and skills"
  ],
  "facilities": {
    "title": "Facilities & Infrastructure",
    "description": "State-of-the-art facilities supporting comprehensive medical education and research",
    "laboratories": [
      {
        "name": "Anatomy/Physiology Laboratory",
        "description": "Well-equipped laboratory for study of human anatomy and physiological processes"
      },
      {
        "name": "Pathology Laboratory",
        "description": "Modern facility for disease diagnosis and pathological studies"
      },
      {
        "name": "Pharmacy Laboratory",
        "description": "Specialized laboratory for preparation and analysis of homoeopathic medicines"
      },
      {
        "name": "Physics Laboratory",
        "description": "Laboratory equipped for physical science experiments and demonstrations"
      },
      {
        "name": "Chemistry Laboratory",
        "description": "Comprehensive chemistry laboratory for biochemical and pharmaceutical analysis"
      }
    ],
    "museums": [
      {
        "name": "Museum of Anatomy",
        "description": "Collection of anatomical specimens and models for medical education"
      },
      {
        "name": "Museum of Pathology",
        "description": "Pathological specimens demonstrating various disease processes"
      },
      {
        "name": "Museum of Pharmacology",
        "description": "Display of medicinal plants and homoeopathic materia medica"
      }
    ],
    "teachingAids": {
      "equipment": "Modern charts and specimens demonstrated to students by respective lecturers",
      "resources": "Comprehensive collection of educational materials and reference books"
    },
    "researchCenter": {
      "description": "Dedicated research facility for advancing homoeopathic and alternative medicine",
      "requirement": "Application in writing stating credentials or curriculum vitae",
      "process": "Interview when need be"
    },
    "library": {
      "description": "Extensive collection of medical texts, journals, and reference materials",
      "specialCollections": "Rare homoeopathic manuscripts and historical documents"
    },
    "clinicalFacilities": {
      "hospitalWing": "Teaching hospital for practical clinical training",
      "outpatientDepartment": "OPD for student clinical exposure and patient care",
      "inpatientFacility": "Beds for patient admission and observation"
    }
  },
  "fellowshipPrivileges": [
    "Certificate of fellowship, signed personally by the patron of the college",
    "Title fellow of the modern college of Homoeopathy/Alternative medicine and use of the letters (FMOCHAM)",
    "Eligibility for Associate membership of the All Nigerian Homeopathic medical association",
    "Preferential rates and reservation at all College seminars worldwide",
    "Advisory information and support services",
    "Receipt of all college international Newsletters free for three years"
  ],
  "medicalPhilosophy": {
    "founder": "Dr. Samuel Christian Frederick Hahnemann",
    "principles": "Classical and modern Homoeopathy",
    "approach": "Wholistic research and natural therapeutics",
    "philosophy": "Alternative medicine embodies scientific methods and art of healing"
  },
  "recognition": {
    "who": "World Health Organization recognizing that no system of medicine is a panacea",
    "treatmentApproach": "Rational treatment consists not so much on curing or removing diseases, but on restoring maximum function and supporting patient in making necessary lifestyle changes",
    "role": "Practitioner fulfils essential educative and preventive role",
    "internationalSupport": "Many civilized countries taking steps to strengthen alternative legal position, some giving federal and state support"
  },
  "legacy": {
    "graduates": "Produced eminent Homeopathic medical Doctors and nurses in almost all states in Nigeria and other countries like Cameroun, Ghana etc.",
    "reputation": "Dr. E. U. Umoren's name enshrined in legends, deeds sung by village ministrels throughout Nigeria",
    "impact": "Became the king of a small principality, but yet reigns supreme in the heart of millions of countrymen",
    "historicalSignificance": "Passed into history and has become a name"
  }
}
